hotelReservation/results/client_load_sweeps/20260331T192714Z_recommendations/logs/wrk_recommendations_18000.log
Running 2m test @ http://c220g1-030826.wisc.cloudlab.us:5000
  4 threads and 128 connections

  Thread calibration: mean lat.: 6.261ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 6.545ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 6.208ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 6.229ms, rate sampling interval: 23ms

-----------------------------------------------------------------------
Test Results @ http://c220g1-030826.wisc.cloudlab.us:5000 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.09ms    4.19ms  21.73ms   85.60%
    Req/Sec     4.60k   501.51     5.82k    68.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.81ms
 75.000%    7.40ms
 90.000%   11.10ms
 99.000%   21.73ms
 99.900%   34.65ms
 99.990%   61.06ms
 99.999%   81.09ms
100.000%  103.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.695     0.000000            1         1.00
       2.625     0.100000       198187         1.11
       3.175     0.200000       396392         1.25
       3.667     0.300000       594627         1.43
       4.195     0.400000       792950         1.67
       4.811     0.500000       990859         2.00
       5.179     0.550000      1089362         2.22
       5.599     0.600000      1187995         2.50
       6.103     0.650000      1286874         2.86
       6.695     0.700000      1386375         3.33
       7.403     0.750000      1485166         4.00
       7.811     0.775000      1534334         4.44
       8.279     0.800000      1584112         5.00
       8.807     0.825000      1633476         5.71
       9.431     0.850000      1683290         6.67
      10.175     0.875000      1732687         8.00
      10.607     0.887500      1757410         8.89
      11.103     0.900000      1781878        10.00
      11.663     0.912500      1806565        11.43
      12.327     0.925000      1831383        13.33
      13.119     0.937500      1856194        16.00
      13.575     0.943750      1868538        17.78
      14.095     0.950000      1880846        20.00
      14.679     0.956250      1893163        22.86
      15.391     0.962500      1905635        26.67
      16.215     0.968750      1917906        32.00
      16.719     0.971875      1924136        35.56
      17.279     0.975000      1930407        40.00
      17.903     0.978125      1936558        45.71
      18.655     0.981250      1942730        53.33
      19.519     0.984375      1948873        64.00
      20.015     0.985938      1951943        71.11
      20.623     0.987500      1955075        80.00
      21.279     0.989062      1958136        91.43
      22.063     0.990625      1961274       106.67
      22.991     0.992188      1964319       128.00
      23.535     0.992969      1965877       142.22
      24.143     0.993750      1967427       160.00
      24.831     0.994531      1968965       182.86
      25.647     0.995313      1970494       213.33
      26.687     0.996094      1972055       256.00
      27.311     0.996484      1972815       284.44
      27.951     0.996875      1973592       320.00
      28.735     0.997266      1974360       365.71
      29.615     0.997656      1975149       426.67
      30.655     0.998047      1975911       512.00
      31.263     0.998242      1976296       568.89
      31.919     0.998437      1976680       640.00
      32.767     0.998633      1977073       731.43
      33.663     0.998828      1977457       853.33
      34.815     0.999023      1977847      1024.00
      35.615     0.999121      1978040      1137.78
      36.415     0.999219      1978230      1280.00
      37.471     0.999316      1978421      1462.86
      38.751     0.999414      1978614      1706.67
      40.159     0.999512      1978806      2048.00
      41.087     0.999561      1978902      2275.56
      42.367     0.999609      1979000      2560.00
      43.967     0.999658      1979096      2925.71
      45.631     0.999707      1979193      3413.33
      47.711     0.999756      1979290      4096.00
      49.247     0.999780      1979337      4551.11
      51.071     0.999805      1979386      5120.00
      53.055     0.999829      1979434      5851.43
      55.519     0.999854      1979483      6826.67
      58.079     0.999878      1979531      8192.00
      59.903     0.999890      1979555      9102.22
      61.375     0.999902      1979579     10240.00
      63.263     0.999915      1979603     11702.86
      65.087     0.999927      1979627     13653.33
      67.839     0.999939      1979652     16384.00
      68.991     0.999945      1979664     18204.44
      70.847     0.999951      1979676     20480.00
      72.255     0.999957      1979688     23405.71
      74.431     0.999963      1979701     27306.67
      75.327     0.999969      1979712     32768.00
      76.479     0.999973      1979718     36408.89
      76.735     0.999976      1979724     40960.00
      77.055     0.999979      1979730     46811.43
      77.631     0.999982      1979736     54613.33
      78.975     0.999985      1979742     65536.00
      79.423     0.999986      1979746     72817.78
      79.807     0.999988      1979748     81920.00
      80.383     0.999989      1979751     93622.86
      81.407     0.999991      1979754    109226.67
      82.431     0.999992      1979757    131072.00
      83.327     0.999993      1979759    145635.56
      83.583     0.999994      1979760    163840.00
      84.031     0.999995      1979762    187245.71
      84.927     0.999995      1979763    218453.33
      85.311     0.999996      1979765    262144.00
      87.807     0.999997      1979766    291271.11
      87.807     0.999997      1979766    327680.00
      88.639     0.999997      1979767    374491.43
      92.671     0.999998      1979768    436906.67
      93.695     0.999998      1979769    524288.00
      93.695     0.999998      1979769    582542.22
      93.695     0.999998      1979769    655360.00
      93.759     0.999999      1979770    748982.86
      93.759     0.999999      1979770    873813.33
      99.455     0.999999      1979771   1048576.00
      99.455     0.999999      1979771   1165084.44
      99.455     0.999999      1979771   1310720.00
      99.455     0.999999      1979771   1497965.71
      99.455     0.999999      1979771   1747626.67
     103.615     1.000000      1979772   2097152.00
     103.615     1.000000      1979772          inf
#[Mean    =        6.085, StdDeviation   =        4.186]
#[Max     =      103.552, Total count    =      1979772]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  2155831 requests in 2.00m, 1.18GB read
Requests/sec:  17965.27  
Transfer/sec:     10.07MB